## Merge, Join and Concatenate

In [3]:
import numpy as np
import pandas as pd

In [6]:
data1 = {
    "Emp ID":["E01","E02","E03","E04","E05","E06"],
    "Name":["Vashu","Vishakha","Priyansh","Munmun","kittu","namish"],
    "Age":[19,18,20,17,15,12]

}

data2 = {
    "Emp ID":["E01","E02","E03","E04","E05","E06"],
    "Salary":[50000,90000,80000,100000,25000,20000]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print()
print(df2)

  Emp ID      Name  Age
0    E01     Vashu   19
1    E02  Vishakha   18
2    E03  Priyansh   20
3    E04    Munmun   17
4    E05     kittu   15
5    E06    namish   12

  Emp ID  Salary
0    E01   50000
1    E02   90000
2    E03   80000
3    E04  100000
4    E05   25000
5    E06   20000

## Merge

In [7]:
print(pd.merge(df1,df2,on="Emp ID"))

  Emp ID      Name  Age  Salary
0    E01     Vashu   19   50000
1    E02  Vishakha   18   90000
2    E03  Priyansh   20   80000
3    E04    Munmun   17  100000
4    E05     kittu   15   25000
5    E06    namish   12   20000

In [8]:
print(pd.merge(df1,df2,how="left"))

  Emp ID      Name  Age  Salary
0    E01     Vashu   19   50000
1    E02  Vishakha   18   90000
2    E03  Priyansh   20   80000
3    E04    Munmun   17  100000
4    E05     kittu   15   25000
5    E06    namish   12   20000

In [9]:
print(pd.merge(df1,df2,how="right"))

  Emp ID      Name  Age  Salary
0    E01     Vashu   19   50000
1    E02  Vishakha   18   90000
2    E03  Priyansh   20   80000
3    E04    Munmun   17  100000
4    E05     kittu   15   25000
5    E06    namish   12   20000

In [11]:
data3 = {
    "Emp ID":["E01","E02","E03","E04","E05","E06"],
    "Name":["Vashu","Vishakha","Priyansh","Munmun","kittu","namish"],
    "Age":[19,18,20,17,15,12]
}

data4 = {
    "Emp ID":["E07","E08","E09","E10","E11","E12"],
    "Name":["Ashwin","Arjun","vish","Mannu","kritika","Amish"],
    "Age":[11,16,21,8,14,13]
}

df3 = pd.DataFrame(data3)
df4 = pd.DataFrame(data4)
print(df3)
print()
print(df4)

  Emp ID      Name  Age
0    E01     Vashu   19
1    E02  Vishakha   18
2    E03  Priyansh   20
3    E04    Munmun   17
4    E05     kittu   15
5    E06    namish   12

  Emp ID     Name  Age
0    E07   Ashwin   11
1    E08    Arjun   16
2    E09     vish   21
3    E10    Mannu    8
4    E11  kritika   14
5    E12    Amish   13

In [13]:
print(pd.concat([df3,df4]))

  Emp ID      Name  Age
0    E01     Vashu   19
1    E02  Vishakha   18
2    E03  Priyansh   20
3    E04    Munmun   17
4    E05     kittu   15
5    E06    namish   12
0    E07    Ashwin   11
1    E08     Arjun   16
2    E09      vish   21
3    E10     Mannu    8
4    E11   kritika   14
5    E12     Amish   13